Tekla Open API Reference for Tekla Structures 2025
IAxisAlignedBoundingBox Interface
 The IAxisAlignedBoundingBox interface is implemented by objects that have an axis aligned bounding box.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public interface IAxisAlignedBoundingBox
Public Interface IAxisAlignedBoundingBox
The IAxisAlignedBoundingBox type exposes the following members.
Methods
Name | Description
GetAxisAlignedBoundingBox
 Gets the bounding box for the current object in the global axis coordinate system.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace